Tekla.Structures.TeklaStructuresInternal.Operation
Internal application operations.

Tekla.Structures.TeklaStructuresInternal.Operation.GetAtcUserAsync(System.Boolean)
Get logged in user data.
askLogin: If true, and user is not logged in yet, shows the dialog to log in. If false, only refreshes token if user logged in, otherwise
returns null without asking user.
Returns: Awaitable task which returns the user data, or null if user has not logged in.

Tekla.Structures.TeklaStructuresInternal.Operation.dotExportGetAttributeFile(System.String,Tekla.Structures.TeklaStructuresInternal.Operation.SharingAttributeFileLocationType)
Gets full path to attribute file with specified name.
filename: The filename.
locationType: The optional location type of where to look for the file.
Returns: Full path to attribute, or null if file was not found.